MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m256/thirdparty/m256/psio_reg.h
typedef struct
{
    /**
    * @var GNCT_T::GENCTL
    * Offset: 0x40  PSIOn General Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1:0]   |IOMODE    |IO Mode
    * |        |          |I/O mode state represent the I/O state when slot controller has not started counting or slot controller has started counting but has not cross the switch I/O mode check point.
    * |        |          |00 = Input mode.
    * |        |          |01 = Output mode.
    * |        |          |10 = Open-drain.
    * |        |          |11 = Quasi-bidirectional Mode.
    * |        |          |Note1: When slot controller stops counting, it will switch to the current I/O mode setting.
    * |        |          |Note2: When PSIO uses quasi mode or open drain mode to trigger slot controller, the initial or interval state need to be set output high level, or the pin will not be trigger.
    * |[3:2]   |INITIAL   |Initial Output
    * |        |          |The output state of PSIO when slot controller stops counting and IDLE (PSIO_SCnCTL[25]) is 1.
    * |        |          |00 = Low level.
    * |        |          |01 = High level.
    * |        |          |10 = Last output.
    * |        |          |11 = Toggle.
    * |        |          |Note1: Only when IO_MODE is not input mode, then this register is effective.
    * |        |          |Note2: This bit is effective only when IDLE(PSIO_SCnCTL[25]) is high.
    * |[5:4]   |INTERVAL  |Interval Output
    * |        |          |The output of PSIO when slot controller stops counting and IDLE (PSIO_SCnCTL[25]) is 0.
    * |        |          |00 = Low level.
    * |        |          |01 = High level.
    * |        |          |10 = Last output.
    * |        |          |11 = Toggle.
    * |        |          |Note1: Only when IO_MODE is not input mode, then this register is effective.
    * |        |          |Note2: This bit is effective only when IDLE(PSIO_SCnCTL[25]) is low.
    * |[11:8]  |SW0CP     |Switch0 Check Point
    * |        |          |0000 = No use.
    * |        |          |0001 = CHECK POINT0.
    * |        |          |0010 = CHECK POINT1.
    * |        |          |0011 = CHECK POINT 2.
    * |        |          |0100 = CHECK POINT 3.
    * |        |          |0101 = CHECK POINT 4.
    * |        |          |0110 = CHECK POINT 5.
    * |        |          |0111= CHECK POINT 6.
    * |        |          |1000 = CHECK POINT 7.
    * |        |          |Others: reserved
    * |[15:12] |SW1CP     |Switch1 Check Point
    * |        |          |0000 = No use.
    * |        |          |0001 = CHECK POINT0.
    * |        |          |0010 = CHECK POINT1.
    * |        |          |0011 = CHECK POINT 2.
    * |        |          |0100 = CHECK POINT 3.
    * |        |          |0101 = CHECK POINT 4.
    * |        |          |0110 = CHECK POINT 5.
    * |        |          |0111= CHECK POINT 6.
    * |        |          |1000 = CHECK POINT 7.
    * |        |          |Others: reserved
    * |[17:16] |MODESW0   |Mode Switch0 Point
    * |        |          |Mode at the switch0 point
    * |        |          |00 = Input mode.
    * |        |          |01 = Output mode.
    * |        |          |10 = Open-drain.
    * |        |          |11 = Quasi-bidirectional Mode.
    * |[19:18] |MODESW1   |Mode Switch1 Point
    * |        |          |Mode at the switch1 point
    * |        |          |00 = Input mode.
    * |        |          |01 = Output mode.
    * |        |          |10 = Open-drain mode.
    * |        |          |11 = Quasi-bidirectional Mode.
    * |[25:24] |SCSEL     |Slot Controller Selection
    * |        |          |Select slot controller for check point
    * |        |          |00 = SLOT CONTROLLER0.
    * |        |          |01 = SLOT CONTROLLER1.
    * |        |          |10 = SLOT CONTROLLER2.
    * |        |          |11 = SLOT CONTROLLER3.
    * |[26]    |PINEN     |Pin Enable Bit
    * |        |          |0 = Pin Disabled.
    * |        |          |1 = Pin Enabled.
    * @var GNCT_T::DATCTL
    * Offset: 0x44  PSIOn Data Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[4:0]   |OUTDATWD  |Output Data Width
    * |        |          |Indicate the data width of OUTPUT DATA register.
    * |        |          |Output data size = OUTDATWD +1.
    * |        |          |e.g.
    * |        |          |5'b00000 = 1 bit.
    * |        |          |5'b11111=32 bit.
    * |[12:8]  |INDATWD   |Input Data Width
    * |        |          |Indicate the data width of INPUT DATA register.
    * |        |          |Input data size = INDATWD +1.
    * |        |          |e.g.
    * |        |          |5'b00000 = 1 bit.
    * |        |          |5'b11111=32 bit.
    * |[16]    |ORDER     |Order
    * |        |          |The order of output data and input data
    * |        |          |Data transfer start form
    * |        |          |0 = LSB.
    * |        |          |1 = MSB.
    * |[25:24] |OUTDEPTH  |Output Data Depth
    * |        |          |Represent the data depth of the output buffer, when data width is larger than 16-bit, this setting can be ignored.
    * |        |          |When the data width is between 9-bit and 16 bit ,
    * |        |          |0 = OUTDEPTH [0], the data depth is 1.
    * |        |          |1 = OUTDEPTH [0], the data depth is 2.
    * |        |          |When the data width is less than or equal to 8-bit.
    * |        |          |0 = OUTDEPTH, the data depth is 1.
    * |        |          |1 = OUTDEPTH, the data depth is 2.
    * |        |          |2 = OUTDEPTH, the data depth is 3.
    * |        |          |3 = OUTDEPTH, the data depth is 4.
    * |        |          |Note1: data depth impact when the output empty flag and output under flow flag will be set to 1.
    * |        |          |Note2: There is no difference of data depth no matter using software program data or PDMA program data.
    * |[29:28] |INDEPTH   |Input Data Depth
    * |        |          |Represent the data depth of the input buffer, when data width is larger than 16-bit, this setting can be ignored.
    * |        |          |When the data width is between 9-bit and 16 bit ,
    * |        |          |0 = INDEPTH[0], the data depth is 1.
    * |        |          |1 = INDEPTH[0], the data depth is 2.
    * |        |          |When the data width is less than or equal to 8-bit.
    * |        |          |0 = INDEPTH, the data depth is 1.
    * |        |          |1 = INDEPTH, the data depth is 2.
    * |        |          |2 = INDEPTH, the data depth is 3.
    * |        |          |3 = INDEPTH, the data depth is 4.
    * |        |          |Note1: data depth impact when the full flag and input over flow flag will be set to 1.
    * |        |          |Note2: There is no difference of data depth no matter using software program data or PDMA program data.
    * @var GNCT_T::INSTS
    * Offset: 0x48  PSIOn Input Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[7:0]   |INSTS     |Input Status
    * |        |          |Status input buffer
    * |        |          |(read clear)
    * |        |          |Note: When the valid bit is set, the valid bits number of INSTS is equal to the number of check points from the previous time INSTS up2025-07-16 to the current INSTS up2025-07-16.
    * @var GNCT_T::INDAT
    * Offset: 0x4C  PSIOn Input Data Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[31:0]  |INDAT     |Input Data Buffer
    * |        |          |This register can be read clear.
    * |        |          |Note: The input data sample time is according to the slot length
    * |        |          |The sampling time is near 3/4 slot
    * |        |          |When the slot length is 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, PSIO sample input data when the slot controller count to 1, 2, 2, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9.
    * @var GNCT_T::OUTDAT
    * Offset: 0x50  PSIOn Output Data Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[31:0]  |OUTDAT    |Output Data Buffer
    * |        |          |This field is used to configure output data.
    * @var GNCT_T::CPCTL0
    * Offset: 0x54  PSIOn Check Point Control 0 Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[2:0]   |CKPT0     |Check Point 0
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[6:4]   |CKPT1     |Check Point 1
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[10:8]  |CKPT2     |Check Point 2
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[14:12] |CKPT3     |Check Point 3
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[18:16] |CKPT4     |Check Point 4
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[22:20] |CKPT5     |Check Point 5
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[26:24] |CKPT6     |Check Point 6
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT6.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * |[30:28] |CKPT7     |Check Point 7
    * |        |          |This field is used to link check point and slot controller slot.
    * |        |          |0000 = No use.
    * |        |          |0001 = SLOT0.
    * |        |          |0010 = SLOT1.
    * |        |          |0011 = SLOT2.
    * |        |          |0100 = SLOT3.
    * |        |          |0101 = SLOT4.
    * |        |          |0110 = SLOT5.
    * |        |          |0111 = SLOT6.
    * |        |          |1000 = SLOT7.
    * |        |          |Others = Reserved.
    * |        |          |Note1: If there are two check points select the same SLOT, pin will follow settings of the smaller check point number.
    * |        |          |Note2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.
    * @var GNCT_T::CPCTL1
    * Offset: 0x58  PSIOn Check Point Control1 Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[2:0]   |CKPT0ACT  |Check Point 0 Action
    * |        |          |Select check point action at check point0
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[6:4]   |CKPT1ACT  |Check Point 1 Action
    * |        |          |Select check point action at check point1
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[10:8]  |CKPT2ACT  |Check Point 2 Action
    * |        |          |Select check point action at check point2
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[14:12] |CKPT3ACT  |Check Point 3 Action
    * |        |          |Select check point action at check point3
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[18:16] |CKPT4ACT  |Check Point 4 Action
    * |        |          |Select check point action at check point4
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[22:20] |CKPT5ACT  |Check Point 5 Action
    * |        |          |Select check point action at check point5
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[26:24] |CKPT6ACT  |Check Point 6 Action
    * |        |          |Select check point action at check point6
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    * |[30:28] |CKPT7ACT  |Check Point 7 Action
    * |        |          |Select check point action at check point7
    * |        |          |000 = output level low.
    * |        |          |001 = output level high.
    * |        |          |010 = output from data buffer.
    * |        |          |011 = output toggle.
    * |        |          |100 = input data buffer.
    * |        |          |101 = input status.
    * |        |          |110 = input status record and up2025-07-16.
    * |        |          |Others = reserved.
    * |        |          |Note: Pin action must meet the correlated I/O mode (PSIOn_GENCTL[1:0])
    */
    __IO uint32_t GENCTL;                /*!< PSIOn General Control Register                                           */
    __IO uint32_t DATCTL;                /*!< PSIOn Data Control Register                                              */
    __I  uint32_t INSTS;                 /*!< PSIOn Input Status Register                                              */
    __I  uint32_t INDAT;                 /*!< PSIOn Input Data Register                                                */
    __O  uint32_t OUTDAT;                /*!< PSIOn Output Data Register                                               */
    __IO uint32_t CPCTL0;                /*!< PSIOn Check Point Control 0 Register                                     */
    __IO uint32_t CPCTL1;                /*!< PSIOn Check Point Control1 Register                                      */
    __I  uint32_t RESERVE0[1];
} GNCT_T;

