MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m256/thirdparty/m256/psio_reg.h
typedef struct
{
    /**
     * @var PSIO_T::INTCTL
     * Offset: 0x00  PSIO Interrupt Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |CONI0SS   |Configurable Interrupt 0 Slot Selection
     * |        |          |0000: NO USE
     * |        |          |0001: SLOT0
     * |        |          |0010: SLOT1
     * |        |          |0011: SLOT2
     * |        |          |0100: SLOT3
     * |        |          |0101: SLOT4
     * |        |          |0110: SLOT5
     * |        |          |0111: SLOT6
     * |        |          |1000: SLOT7
     * |        |          |1001 u2013 1111:Reserved
     * |[6:4]   |CONI1SS   |Configurable Interrupt 1 Slot Selection
     * |        |          |0000: NO USE
     * |        |          |0001: SLOT0
     * |        |          |0010: SLOT1
     * |        |          |0011: SLOT2
     * |        |          |0100: SLOT3
     * |        |          |0101: SLOT4
     * |        |          |0110: SLOT5
     * |        |          |0111: SLOT6
     * |        |          |1000: SLOT7
     * |        |          |1001 u2013 1111:Reserved
     * |[9:8]   |CONI0SCS  |Configurable Interrupt 0 Slot Controller Selection
     * |        |          |Select Slot controller for INT0
     * |        |          |00 = Slot controller 0.
     * |        |          |01 = Slot controller 1.
     * |        |          |10 = Slot controller 2.
     * |        |          |11 = Slot controller 3.
     * |[13:12] |CONI1SCS  |Configurable Interrupt 1 Slot Controller Selection
     * |        |          |Select Slot controller for INT1
     * |        |          |00 = Slot controller 0.
     * |        |          |01 = Slot controller 1.
     * |        |          |10 = Slot controller 2.
     * |        |          |11 = Slot controller 3.
     * |[31]    |LOOPBACK  |Loop Back Test Enable Bit
     * |        |          |If this bit is enabled, PIN0 output will be connected to PIN1 input, PIN1 output will be connected to PIN0 input.
     * |        |          |So do the others pin.
     * @var PSIO_T::INTEN
     * Offset: 0x04  PSIO Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CON0IE    |Configurable Interrupt 0 Enable Bit
     * |        |          |This field is used to enable selective interrupt 0.
     * |        |          |0 = Selective interrupt 0 Disabled.
     * |        |          |1 = Selective interrupt 0 Enabled.
     * |[1]     |CON1IE    |Configurable Interrupt 1 Enable Bit
     * |        |          |This field is used to enable selective interrupt 1.
     * |        |          |0 = Selective interrupt 1 Disabled.
     * |        |          |1 = Selective interrupt 1 Enabled.
     * |[2]     |MISMATIE  |Mismatch Interrupt Enable Bit
     * |        |          |This field is used to enable mismatch interrupt.
     * |        |          |0 = Mismatch interrupt Disabled.
     * |        |          |1 = Mismatch interrupt Enabled.
     * |[3]     |TERRIE    |Transfer Error Interrupt Enable Bit
     * |        |          |This field is used to enable transfer error interrupt.
     * |        |          |0 = Transfer error interrupt Disabled.
     * |        |          |1 = Transfer error interrupt Enabled.
     * |[4]     |SC0IE     |Slot Controller 0 Done Interrupt Enable Bit
     * |        |          |This field is used to enable Slot controller 0 finish interrupt.
     * |        |          |0 = Slot controller 0 finish interrupt Disabled.
     * |        |          |1 = Slot controller 0 finish interrupt Enabled.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[5]     |SC1IE     |Slot Controller 1 Done Interrupt Enable Bit
     * |        |          |This field is used to enable Slot controller 1 finish interrupt.
     * |        |          |0 = Slot controller 1 finish interrupt Disabled.
     * |        |          |1 = Slot controller 1 finish interrupt Enabled.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[6]     |SC2IE     |Slot Controller 2 Done Interrupt Enable Bit
     * |        |          |This field is used to enable Slot controller 2 finish interrupt.
     * |        |          |0 = Slot controller 2 finish interrupt Disabled.
     * |        |          |1 = Slot controller 2 finish interrupt Enabled.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[7]     |SC3IE     |Slot Controller 3 Done Interrupt Enable Bit
     * |        |          |This field is used to enable Slot controller 3 finish interrupt.
     * |        |          |0 = Slot controller 3 finish interrupt Disabled.
     * |        |          |1 = Slot controller 3 finish interrupt Enabled.
     * |        |          |Note: This bit can be cleared by writing 1.
     * @var PSIO_T::INTSTS
     * Offset: 0x08  PSIO Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CON0IF    |Configurable Interrupt 0 Flag
     * |        |          |The setting interrupt is trigger at the end of the check point of the pin.
     * |        |          |The setting interrupt is trigger at the end of the check point of the pin.
     * |        |          |0 = Condition in PSIO_INTCTL is not triggered.
     * |        |          |1 = Condition in PSIO_INTCTL is triggered.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[1]     |CON1IF    |Configurable Interrupt 1 Flag
     * |        |          |The setting interrupt is trigger at the end of the check point of the pin.
     * |        |          |0 = Condition in PSIO_INTCTL is not triggered.
     * |        |          |1 = Condition in PSIO_INTCTL is triggered.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[2]     |MISMATIF  |Mismatch Interrupt Flag
     * |        |          |This flag shows the amounts of data are not the same in each pins with PDMA enabled.
     * |        |          |If this situation happens, all slot controllers stop counting.
     * |        |          |0 = Each pin with PDMA enabled receive or transfer data in the same rate.
     * |        |          |1 = Each pin with PDMA enabled receive or transfer data in different rate.
     * |        |          |Note1: This flag is only effective on the pin with PDMA enabled.
     * |        |          |Note2: This bit can be cleared by writing 1.
     * |[3]     |TERRIF    |Transfer Error Interrupt Status Flag
     * |        |          |This field is used for transfer error interrupt status flag
     * |        |          |The transfer error states is at PSIO_DATCTL register which includes receive buffer overflow error INOVER (PSIOn_DATCTL[14]), transmit buffer shortage error OUTUFER (PSIOn_DATCTL[6])
     * |        |          |0 = Transfer error interrupt did not occur.
     * |        |          |1 = Transfer error interrupt occurred.
     * |        |          |Note1: This field is the status flag of INOVER or OUTUFER.
     * |        |          |Note2: This bit can only be cleared by writing 1 to coordinate transfer error.
     * |[4]     |SC0IF     |Slot Controller 0 Done Interrupt Status Flag
     * |        |          |This field is used for slot controller 0 finish interrupt status flag.
     * |        |          |0 = Slot controller 0 done interrupt did not occur.
     * |        |          |1 = Slot controller 0 done interrupt occurred.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[5]     |SC1IF     |Slot Controller 1 Done Interrupt Status Flag
     * |        |          |This field is used for slot controller 1 finish interrupt status flag.
     * |        |          |0 = Slot controller 1 done interrupt did not occur.
     * |        |          |1 = Slot controller 1 done interrupt occurred.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[6]     |SC2IF     |Slot Controller 2 Done Interrupt Status Flag
     * |        |          |This field is used for slot controller 2 finish interrupt status flag.
     * |        |          |0 = Slot controller 2 done interrupt did not occur.
     * |        |          |1 = Slot controller 2 done interrupt occurred.
     * |        |          |Note: This bit can be cleared by writing 1.
     * |[7]     |SC3IF     |Slot Controller 3 Done Interrupt Status Flag
     * |        |          |This field is used for slot controller 3 finish interrupt status flag.
     * |        |          |0 = Slot controller 3 done interrupt did not occur.
     * |        |          |1 = Slot controller 3 done interrupt occurred.
     * |        |          |Note: This bit can be cleared by writing 1.
     * @var PSIO_T::TRANSTS
     * Offset: 0x0C  PSIO Transfer Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |INFULL0   |Input Data Full Flag0 (Read Only)
     * |        |          |0 = The pin0 input data is empty.
     * |        |          |1 = The pin0 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[1]     |INOVER0   |Input Data Overflow Flag0
     * |        |          |0 = The pin0 input data does not occur overflow.
     * |        |          |1 = The pin0 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[2]     |OUTEPY0   |Output Data Empty Flag0 (Read Only)
     * |        |          |0 = The pin0 output data is full.
     * |        |          |1 = The pin0 output data is empty.
     * |[3]     |OUTUF0    |Output Data Underflow Flag0
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin0 output data is not underflow.
     * |        |          |1 = The pin0 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[4]     |INFULL1   |Input Data Full Flag1 (Read Only)
     * |        |          |0 = The pin1 input data is empty.
     * |        |          |1 = The pin1 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[5]     |INOVER1   |Input Data Overflow Flag1
     * |        |          |0 = The pin1 input data does not occur overflow.
     * |        |          |1 = The pin1 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[6]     |OUTEPY1   |Output Data Empty Flag1
     * |        |          |0 = The pin1 output data is full.
     * |        |          |1 = The pin1 output data is empty.
     * |[7]     |OUTUF1    |Output Data Underflow Flag1
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin1 output data is not underflow.
     * |        |          |1 = The pin1 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[8]     |INFULL2   |Input Data Full Flag2 (Read Only)
     * |        |          |0 = The pin2 input data is empty.
     * |        |          |1 = The pin2 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin is enabled.
     * |[9]     |INOVER2   |Input Data Overflow Flag2
     * |        |          |0 = The pin2 input data does not occur overflow.
     * |        |          |1 = The pin2 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[10]    |OUTEPY2   |Output Data Empty Flag2 (Read Only)
     * |        |          |0 = The pin2 output data is full.
     * |        |          |1 = The pin2 output data is empty.
     * |[11]    |OUTUF2    |Output Data Underflow Flag2
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin3 output data is not underflow.
     * |        |          |1 = The pin3 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[12]    |INFULL3   |Input Data Full Flag3 (Read Only)
     * |        |          |0 = The pin3 input data is empty.
     * |        |          |1 = The pin3 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin is enabled.
     * |[13]    |INOVER3   |Input Data Overflow Flag3
     * |        |          |0 = The pin3 input data does not occur overflow.
     * |        |          |1 = The pin3 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[14]    |OUTEPY3   |Output Data Empty Flag3 (Read Only)
     * |        |          |0 = The pin3 output data is full.
     * |        |          |1 = The pin3 output data is empty.
     * |[15]    |OUTUF3    |Output Data Underflow Flag3
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin3 output data is not underflow.
     * |        |          |1 = The pin3 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[16]    |INFULL4   |Input Data Full Flag4 (Read Only)
     * |        |          |0 = The pin4 input data is empty.
     * |        |          |1 = The pin4 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin is enabled.
     * |[17]    |INOVER4   |Input Data Overflow Flag4
     * |        |          |0 = The pin4 input data does not occur overflow.
     * |        |          |1 = The pin4 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[18]    |OUTEPY4   |Output Data Empty Flag4 (Read Only)
     * |        |          |0 = The pin4 output data is full.
     * |        |          |1 = The pin4 output data is empty.
     * |[19]    |OUTUF4    |Output Data Underflow Flag4
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin4 output data is not underflow.
     * |        |          |1 = The pin4 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[20]    |INFULL5   |Input Data Full Flag5 (Read Only)
     * |        |          |0 = The pin5 input data is empty.
     * |        |          |1 = The pin5 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[21]    |INOVER5   |Input Data Overflow Flag5
     * |        |          |0 = The pin5 input data does not occur overflow.
     * |        |          |1 = The pin5 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[22]    |OUTEPY5   |Output Data Empty Flag5 (Read Only)
     * |        |          |0 = The pin5 output data is full.
     * |        |          |1 = The pin5 output data is empty.
     * |[23]    |OUTUF5    |Output Data Underflow Flag5
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin5 output data is not underflow.
     * |        |          |1 = The pin5 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin is enabled.
     * |[24]    |INFULL6   |Input Data Full Flag6 (Read Only)
     * |        |          |0 = The pin6 input data is empty.
     * |        |          |1 = The pin6 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[25]    |INOVER6   |Input Data Overflow Flag6
     * |        |          |0 = The pin6 input data does not occur overflow.
     * |        |          |1 = The pin6 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[26]    |OUTEPY6   |Output Data Empty Flag6 (Read Only)
     * |        |          |0 = The pin6 output data is full.
     * |        |          |1 = The pin6 output data is empty.
     * |[27]    |OUTUF6    |Output Data Underflow Flag6
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin6 output data is not underflow.
     * |        |          |1 = The pin6 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[28]    |INFULL7   |Input Data Full Flag7 (Read Only)
     * |        |          |0 = The pin7 input data is empty.
     * |        |          |1 = The pin7 input data is full.
     * |        |          |Note: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[29]    |INOVER7   |Input Data Overflow Flag7
     * |        |          |0 = The pin7 input data does not occur overflow.
     * |        |          |1 = The pin7 input data occurs overflow.
     * |        |          |Note1: When input Overflow happened, it will keep the current data, and discard the upcoming data.
     * |        |          |Note2: When overflow happens, related slot controller will be stopped.
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * |[30]    |OUTEPY7   |Output Data Empty Flag7 (Read Only)
     * |        |          |0 = The pin7 output data is full.
     * |        |          |1 = The pin7 output data is empty.
     * |[31]    |OUTUF7    |Output Data Underflow Flag7
     * |        |          |When PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.
     * |        |          |0 = The pin7 output data is not underflow.
     * |        |          |1 = The pin7 output data is underflow.
     * |        |          |Note1: When output data shortage happened, it will output 0.
     * |        |          |Note2: When underflow happens, related slot controller will be stopped.
