MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m256/thirdparty/m256/psio_reg.h
#define PSIO_INTCTL_CONI0SS_Pos         (0)                                               /*!< PSIO_T::INTCTL: INT0CSEL Position      */
#define PSIO_INTCTL_CONI0SS_Msk         (0xful << PSIO_INTCTL_CONI0SS_Pos)               /*!< PSIO_T::INTCTL: INT0CSEL Mask          */

#define PSIO_INTCTL_CONI1SS_Pos         (4)                                               /*!< PSIO_T::INTCTL: INT1CSEL Position      */
#define PSIO_INTCTL_CONI1SS_Msk         (0xful << PSIO_INTCTL_CONI1SS_Pos)               /*!< PSIO_T::INTCTL: INT1CSEL Mask          */

#define PSIO_INTCTL_CONI0SCS_Pos         (8)                                               /*!< PSIO_T::INTCTL: INT0SSEL Position      */
#define PSIO_INTCTL_CONI0SCS_Msk         (0x3ul << PSIO_INTCTL_CONI0SCS_Pos)               /*!< PSIO_T::INTCTL: INT0SSEL Mask          */

#define PSIO_INTCTL_CONI1SCS_Pos         (12)                                              /*!< PSIO_T::INTCTL: INT1SSEL Position      */
#define PSIO_INTCTL_CONI1SCS_Msk         (0x3ul << PSIO_INTCTL_CONI1SCS_Pos)               /*!< PSIO_T::INTCTL: INT1SSEL Mask          */

#define PSIO_INTCTL_LOOPBACK_Pos         (31)                                              /*!< PSIO_T::INTCTL: LOOPBACK Position      */
#define PSIO_INTCTL_LOOPBACK_Msk         (0x1ul << PSIO_INTCTL_LOOPBACK_Pos)               /*!< PSIO_T::INTCTL: LOOPBACK Mask          */

#define PSIO_INTEN_CON0IE_Pos            (0)                                               /*!< PSIO_T::INTEN: INTEN0 Position         */
#define PSIO_INTEN_CON0IE_Msk            (0x1ul << PSIO_INTEN_CON0IE_Pos)                  /*!< PSIO_T::INTEN: INTEN0 Mask             */

#define PSIO_INTEN_CON1IE_Pos            (1)                                               /*!< PSIO_T::INTEN: INTEN1 Position         */
#define PSIO_INTEN_CON1IE_Msk            (0x1ul << PSIO_INTEN_CON1IE_Pos)                  /*!< PSIO_T::INTEN: INTEN1 Mask             */

#define PSIO_INTEN_MISMATIE_Pos          (2)                                               /*!< PSIO_T::INTEN: MISMATIE Position       */
#define PSIO_INTEN_MISMATIE_Msk          (0x1ul << PSIO_INTEN_MISMATIE_Pos)                /*!< PSIO_T::INTEN: MISMATIE Mask           */

#define PSIO_INTEN_TERRIE_Pos            (3)                                               /*!< PSIO_T::INTEN: TERRIE Position         */
#define PSIO_INTEN_TERRIE_Msk            (0x1ul << PSIO_INTEN_TERRIE_Pos)                  /*!< PSIO_T::INTEN: TERRIE Mask             */

#define PSIO_INTEN_SC0IE_Pos             (4)                                                /*!< PSIO_T::INTEN: SC0IE Position         */
#define PSIO_INTEN_SC0IE_Msk             (0x1ul << PSIO_INTEN_SC0IE_Pos)                    /*!< PSIO_T::INTEN: SC0IE Mask             */

#define PSIO_INTEN_SC1IE_Pos             (5)                                                /*!< PSIO_T::INTEN: SC1IE Position         */
#define PSIO_INTEN_SC1IE_Msk             (0x1ul << PSIO_INTEN_SC1IE_Pos)                    /*!< PSIO_T::INTEN: SC1IE Mask             */

#define PSIO_INTEN_SC2IE_Pos             (6)                                                /*!< PSIO_T::INTEN: SC2IE Position         */
#define PSIO_INTEN_SC2IE_Msk             (0x1ul << PSIO_INTEN_SC2IE_Pos)                    /*!< PSIO_T::INTEN: SC2IE Mask             */

#define PSIO_INTEN_SC3IE_Pos             (7)                                                /*!< PSIO_T::INTEN: SC3IE Position         */
#define PSIO_INTEN_SC3IE_Msk             (0x1ul << PSIO_INTEN_SC3IE_Pos)                    /*!< PSIO_T::INTEN: SC3IE Mask             */

#define PSIO_INTSTS_CON0IF_Pos           (0)                                               /*!< PSIO_T::INTSTS: INTIF0 Position        */
#define PSIO_INTSTS_CON0IF_Msk           (0x1ul << PSIO_INTSTS_CON0IF_Pos)                 /*!< PSIO_T::INTSTS: INTIF0 Mask            */

#define PSIO_INTSTS_CON1IF_Pos           (1)                                               /*!< PSIO_T::INTSTS: INTIF1 Position        */
#define PSIO_INTSTS_CON1IF_Msk           (0x1ul << PSIO_INTSTS_CON1IF_Pos)                 /*!< PSIO_T::INTSTS: INTIF1 Mask            */

#define PSIO_INTSTS_MISMATIF_Pos         (2)                                                /*!< PSIO_T::INTSTS: MISMATIF Position      */
#define PSIO_INTSTS_MISMATIF_Msk         (0x1ul << PSIO_INTSTS_MISMATIF_Pos)               /*!< PSIO_T::INTSTS: MISMATIF Mask          */

#define PSIO_INTSTS_TERRIF_Pos           (3)                                               /*!< PSIO_T::INTSTS: TERRIF Position        */
#define PSIO_INTSTS_TERRIF_Msk           (0x1ul << PSIO_INTSTS_TERRIF_Pos)                 /*!< PSIO_T::INTSTS: TERRIF Mask            */

#define PSIO_INTSTS_SC0IF_Pos            (4)                                               /*!< PSIO_T::INTSTS: SC0IF Position         */
#define PSIO_INTSTS_SC0IF_Msk            (0x1ul << PSIO_INTSTS_SC0IF_Pos)                  /*!< PSIO_T::INTSTS: SC0IF Mask             */

#define PSIO_INTSTS_SC1IF_Pos            (5)                                               /*!< PSIO_T::INTSTS: SC1IF Position         */
#define PSIO_INTSTS_SC1IF_Msk            (0x1ul << PSIO_INTSTS_SC1IF_Pos)                  /*!< PSIO_T::INTSTS: SC1IF Mask             */

#define PSIO_INTSTS_SC2IF_Pos            (6)                                               /*!< PSIO_T::INTSTS: SC2IF Position         */
#define PSIO_INTSTS_SC2IF_Msk            (0x1ul << PSIO_INTSTS_SC2IF_Pos)                  /*!< PSIO_T::INTSTS: SC2IF Mask             */

#define PSIO_INTSTS_SC3IF_Pos            (7)                                               /*!< PSIO_T::INTSTS: SC3IF Position         */
#define PSIO_INTSTS_SC3IF_Msk            (0x1ul << PSIO_INTSTS_SC3IF_Pos)                  /*!< PSIO_T::INTSTS: SC3IF Mask             */

#define PSIO_TRANSTS_INFULL0_Pos         (0)                                               /*!< PSIO_T::TRANSTS: INFULL0 Position      */
#define PSIO_TRANSTS_INFULL0_Msk         (0x1ul << PSIO_TRANSTS_INFULL0_Pos)               /*!< PSIO_T::TRANSTS: INFULL0 Mask          */

#define PSIO_TRANSTS_INOVER0_Pos         (1)                                               /*!< PSIO_T::TRANSTS: INOVER0 Position      */
#define PSIO_TRANSTS_INOVER0_Msk         (0x1ul << PSIO_TRANSTS_INOVER0_Pos)               /*!< PSIO_T::TRANSTS: INOVER0 Mask          */

#define PSIO_TRANSTS_OUTEPY0_Pos         (2)                                               /*!< PSIO_T::TRANSTS: OUTEPY0 Position      */
#define PSIO_TRANSTS_OUTEPY0_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY0_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY0 Mask          */

#define PSIO_TRANSTS_OUTUF0_Pos          (3)                                               /*!< PSIO_T::TRANSTS: OUTUF0 Position       */
#define PSIO_TRANSTS_OUTUF0_Msk          (0x1ul << PSIO_TRANSTS_OUTUF0_Pos)                /*!< PSIO_T::TRANSTS: OUTUF0 Mask           */

#define PSIO_TRANSTS_INFULL1_Pos         (4)                                               /*!< PSIO_T::TRANSTS: INFULL1 Position      */
#define PSIO_TRANSTS_INFULL1_Msk         (0x1ul << PSIO_TRANSTS_INFULL1_Pos)               /*!< PSIO_T::TRANSTS: INFULL1 Mask          */

#define PSIO_TRANSTS_INOVER1_Pos         (5)                                               /*!< PSIO_T::TRANSTS: INOVER1 Position      */
#define PSIO_TRANSTS_INOVER1_Msk         (0x1ul << PSIO_TRANSTS_INOVER1_Pos)               /*!< PSIO_T::TRANSTS: INOVER1 Mask          */

#define PSIO_TRANSTS_OUTEPY1_Pos         (6)                                               /*!< PSIO_T::TRANSTS: OUTEPY1 Position      */
#define PSIO_TRANSTS_OUTEPY1_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY1_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY1 Mask          */

