MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m256/thirdparty/m256/psio_reg.h
#define PSIO_PDMACTL_OPIN5EN_Pos         (5)                                               /*!< PSIO_T::PDMACTL: OPIN5EN Position      */
#define PSIO_PDMACTL_OPIN5EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN5EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN5EN Mask          */

#define PSIO_PDMACTL_OPIN6EN_Pos         (6)                                               /*!< PSIO_T::PDMACTL: OPIN6EN Position      */
#define PSIO_PDMACTL_OPIN6EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN6EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN6EN Mask          */

#define PSIO_PDMACTL_OPIN7EN_Pos         (7)                                               /*!< PSIO_T::PDMACTL: OPIN7EN Position      */
#define PSIO_PDMACTL_OPIN7EN_Msk         (0x1ul << PSIO_PDMACTL_OPIN7EN_Pos)               /*!< PSIO_T::PDMACTL: OPIN7EN Mask          */

#define PSIO_PDMACTL_IPIN0EN_Pos         (8)                                               /*!< PSIO_T::PDMACTL: IPIN0EN Position      */
#define PSIO_PDMACTL_IPIN0EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN0EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN0EN Mask          */

#define PSIO_PDMACTL_IPIN1EN_Pos         (9)                                               /*!< PSIO_T::PDMACTL: IPIN1EN Position      */
#define PSIO_PDMACTL_IPIN1EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN1EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN1EN Mask          */

#define PSIO_PDMACTL_IPIN2EN_Pos         (10)                                              /*!< PSIO_T::PDMACTL: IPIN2EN Position      */
#define PSIO_PDMACTL_IPIN2EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN2EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN2EN Mask          */

#define PSIO_PDMACTL_IPIN3EN_Pos         (11)                                              /*!< PSIO_T::PDMACTL: IPIN3EN Position      */
#define PSIO_PDMACTL_IPIN3EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN3EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN3EN Mask          */

#define PSIO_PDMACTL_IPIN4EN_Pos         (12)                                              /*!< PSIO_T::PDMACTL: IPIN4EN Position      */
#define PSIO_PDMACTL_IPIN4EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN4EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN4EN Mask          */

#define PSIO_PDMACTL_IPIN5EN_Pos         (13)                                              /*!< PSIO_T::PDMACTL: IPIN5EN Position      */
#define PSIO_PDMACTL_IPIN5EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN5EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN5EN Mask          */

#define PSIO_PDMACTL_IPIN6EN_Pos         (14)                                              /*!< PSIO_T::PDMACTL: IPIN6EN Position      */
#define PSIO_PDMACTL_IPIN6EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN6EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN6EN Mask          */

#define PSIO_PDMACTL_IPIN7EN_Pos         (15)                                              /*!< PSIO_T::PDMACTL: IPIN7EN Position      */
#define PSIO_PDMACTL_IPIN7EN_Msk         (0x1ul << PSIO_PDMACTL_IPIN7EN_Pos)               /*!< PSIO_T::PDMACTL: IPIN7EN Mask          */

#define PSIO_PDMACTL_OUTNUM_Pos          (16)                                              /*!< PSIO_T::PDMACTL: OUTNUM Position       */
#define PSIO_PDMACTL_OUTNUM_Msk          (0x7ul << PSIO_PDMACTL_OUTNUM_Pos)                /*!< PSIO_T::PDMACTL: OUTNUM Mask           */

#define PSIO_PDMACTL_OUTSCSEL_Pos        (20)                                              /*!< PSIO_T::PDMACTL: OUTSCSEL Position     */
#define PSIO_PDMACTL_OUTSCSEL_Msk        (0x3ul << PSIO_PDMACTL_OUTSCSEL_Pos)              /*!< PSIO_T::PDMACTL: OUTSCSEL Mask         */

#define PSIO_PDMACTL_INNUM_Pos           (24)                                              /*!< PSIO_T::PDMACTL: INNUM Position        */
#define PSIO_PDMACTL_INNUM_Msk           (0x7ul << PSIO_PDMACTL_INNUM_Pos)                 /*!< PSIO_T::PDMACTL: INNUM Mask            */

#define PSIO_PDMACTL_INSCSEL_Pos         (28)                                              /*!< PSIO_T::PDMACTL: INSCSEL Position      */
#define PSIO_PDMACTL_INSCSEL_Msk         (0x3ul << PSIO_PDMACTL_INSCSEL_Pos)               /*!< PSIO_T::PDMACTL: INSCSEL Mask          */

#define PSIO_PODAT_PDMAOUT_Pos           (0)                                               /*!< PSIO_T::PODAT: PDMAOUT Position        */
#define PSIO_PODAT_PDMAOUT_Msk           (0xfffffffful << PSIO_PODAT_PDMAOUT_Pos)          /*!< PSIO_T::PODAT: PDMAOUT Mask            */

#define PSIO_PIDAT_PDMA_IN_Pos           (0)                                               /*!< PSIO_T::PIDAT: PDMA_IN Position        */
#define PSIO_PIDAT_PDMA_IN_Msk           (0xfffffffful << PSIO_PIDAT_PDMA_IN_Pos)          /*!< PSIO_T::PIDAT: PDMA_IN Mask            */

#define PSIO_SCCT_SCCTL_INISLOT_Pos      (0)                                               /*!< PSIO_T::SCCTL: INISLOT Position       */
#define PSIO_SCCT_SCCTL_INISLOT_Msk      (0xful << PSIO_SCCT_SCCTL_INISLOT_Pos)            /*!< PSIO_T::SCCTL: INISLOT Mask           */

#define PSIO_SCCT_SCCTL_ENDSLOT_Pos      (4)                                               /*!< PSIO_T::SCCTL: ENDSLOT Position       */
#define PSIO_SCCT_SCCTL_ENDSLOT_Msk      (0xful << PSIO_SCCT_SCCTL_ENDSLOT_Pos)            /*!< PSIO_T::SCCTL: ENDSLOT Mask           */

#define PSIO_SCCT_SCCTL_SPLCNT_Pos       (8)                                               /*!< PSIO_T::SCCTL: SPLCNT Position        */
#define PSIO_SCCT_SCCTL_SPLCNT_Msk       (0x3ful << PSIO_SCCT_SCCTL_SPLCNT_Pos)            /*!< PSIO_T::SCCTL: SPLCNT Mask            */

#define PSIO_SCCT_SCCTL_TRIGSRC_Pos          (14)                                              /*!< PSIO_T::SCCTL: TRIGSRC Position       */
#define PSIO_SCCT_SCCTL_TRIGSRC_Msk          (0x3ul << PSIO_SCCT_SCCTL_TRIGSRC_Pos)                /*!< PSIO_T::SCCTL: TRIGSRC Mask           */

#define PSIO_SCCT_SCCTL_START_Pos            (16)                                              /*!< PSIO_T::SCCTL: START Position         */
#define PSIO_SCCT_SCCTL_START_Msk            (0x1ul << PSIO_SCCT_SCCTL_START_Pos)                  /*!< PSIO_T::SCCTL: START Mask             */

#define PSIO_SCCT_SCCTL_REPEAT_Pos           (17)                                              /*!< PSIO_T::SCCTL: REPEAT Position        */
#define PSIO_SCCT_SCCTL_REPEAT_Msk           (0x1ul << PSIO_SCCT_SCCTL_REPEAT_Pos)                 /*!< PSIO_T::SCCTL: REPEAT Mask            */

#define PSIO_SCCT_SCCTL_STOP_Pos            (18)                                                /*!< PSIO_T::SCCTL: STOP Position        */
#define PSIO_SCCT_SCCTL_STOP_Msk            (0x1ul << PSIO_SCCT_SCCTL_STOP_Pos)                 /*!< PSIO_T::SCCTL: STOP Mask            */

#define PSIO_SCCT_SCCTL_BUSY_Pos             (24)                                              /*!< PSIO_T::SCCTL: BUSY Position          */
#define PSIO_SCCT_SCCTL_BUSY_Msk             (0x1ul << PSIO_SCCT_SCCTL_BUSY_Pos)                   /*!< PSIO_T::SCCTL: BUSY Mask              */

#define PSIO_SCCT_SCCTL_IDLE_Pos             (25)                                              /*!< PSIO_T::SCCTL: IDLE Position          */
#define PSIO_SCCT_SCCTL_IDLE_Msk             (0x1ul << PSIO_SCCT_SCCTL_IDLE_Pos)                   /*!< PSIO_T::SCCTL: IDLE Mask              */

