MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m256/thirdparty/m256/psio_reg.h
#define PSIO_SCCT_SCSLOT_SLOT0CNT_Pos        (0)                                               /*!< PSIO_T::SCSLOT: SLOT0CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT0CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT0CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT0CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT1CNT_Pos        (4)                                               /*!< PSIO_T::SCSLOT: SLOT1CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT1CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT1CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT1CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT2CNT_Pos        (8)                                               /*!< PSIO_T::SCSLOT: SLOT2CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT2CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT2CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT2CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT3CNT_Pos        (12)                                              /*!< PSIO_T::SCSLOT: SLOT3CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT3CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT3CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT3CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT4CNT_Pos        (16)                                              /*!< PSIO_T::SCSLOT: SLOT4CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT4CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT4CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT4CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT5CNT_Pos        (20)                                              /*!< PSIO_T::SCSLOT: SLOT5CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT5CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT5CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT5CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT6CNT_Pos        (24)                                              /*!< PSIO_T::SCSLOT: SLOT6CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT6CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT6CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT6CNT Mask         */

#define PSIO_SCCT_SCSLOT_SLOT7CNT_Pos        (28)                                              /*!< PSIO_T::SCSLOT: SLOT7CNT Position     */
#define PSIO_SCCT_SCSLOT_SLOT7CNT_Msk        (0xful << PSIO_SCCT_SCSLOT_SLOT7CNT_Pos)              /*!< PSIO_T::SCSLOT: SLOT7CNT Mask         */

#define PSIO_GNCT_GENCTL_IOMODE_Pos           (0)                                               /*!< PSIO_T::GENCTL: IOMODE Position        */
#define PSIO_GNCT_GENCTL_IOMODE_Msk           (0x3ul << PSIO_GNCT_GENCTL_IOMODE_Pos)                 /*!< PSIO_T::GENCTL: IOMODE Mask            */

#define PSIO_GNCT_GENCTL_INITIAL_Pos          (2)                                               /*!< PSIO_T::GENCTL: INITIAL Position       */
#define PSIO_GNCT_GENCTL_INITIAL_Msk          (0x3ul << PSIO_GNCT_GENCTL_INITIAL_Pos)                /*!< PSIO_T::GENCTL: INITIAL Mask           */

#define PSIO_GNCT_GENCTL_INTERVAL_Pos         (4)                                               /*!< PSIO_T::GENCTL: INTERVAL Position      */
#define PSIO_GNCT_GENCTL_INTERVAL_Msk         (0x3ul << PSIO_GNCT_GENCTL_INTERVAL_Pos)               /*!< PSIO_T::GENCTL: INTERVAL Mask          */

#define PSIO_GNCT_GENCTL_SW0CP_Pos            (8)                                               /*!< PSIO_T::GENCTL: SW0CP Position         */
#define PSIO_GNCT_GENCTL_SW0CP_Msk            (0xful << PSIO_GNCT_GENCTL_SW0CP_Pos)                  /*!< PSIO_T::GENCTL: SW0CP Mask             */

#define PSIO_GNCT_GENCTL_SW1CP_Pos            (12)                                              /*!< PSIO_T::GENCTL: SW1CP Position         */
#define PSIO_GNCT_GENCTL_SW1CP_Msk            (0xful << PSIO_GNCT_GENCTL_SW1CP_Pos)                  /*!< PSIO_T::GENCTL: SW1CP Mask             */

#define PSIO_GNCT_GENCTL_MODESW0_Pos          (16)                                              /*!< PSIO_T::GENCTL: MODESW0 Position       */
#define PSIO_GNCT_GENCTL_MODESW0_Msk          (0x3ul << PSIO_GNCT_GENCTL_MODESW0_Pos)                /*!< PSIO_T::GENCTL: MODESW0 Mask           */

#define PSIO_GNCT_GENCTL_MODESW1_Pos          (18)                                              /*!< PSIO_T::GENCTL: MODESW1 Position       */
#define PSIO_GNCT_GENCTL_MODESW1_Msk          (0x3ul << PSIO_GNCT_GENCTL_MODESW1_Pos)                /*!< PSIO_T::GENCTL: MODESW1 Mask           */

#define PSIO_GNCT_GENCTL_SCSEL_Pos            (24)                                              /*!< PSIO_T::GENCTL: SCSEL Position         */
#define PSIO_GNCT_GENCTL_SCSEL_Msk            (0x3ul << PSIO_GNCT_GENCTL_SCSEL_Pos)                  /*!< PSIO_T::GENCTL: SCSEL Mask             */

#define PSIO_GNCT_GENCTL_PINEN_Pos            (26)                                              /*!< PSIO_T::GENCTL: PINEN Position         */
#define PSIO_GNCT_GENCTL_PINEN_Msk            (0x1ul << PSIO_GNCT_GENCTL_PINEN_Pos)             /*!< PSIO_T::GENCTL: PINEN Mask             */

#define PSIO_GNCT_DATCTL_OUTDATWD_Pos         (0)                                               /*!< PSIO_T::DATCTL: OUTDATWD Position      */
#define PSIO_GNCT_DATCTL_OUTDATWD_Msk         (0x1ful << PSIO_GNCT_DATCTL_OUTDATWD_Pos)              /*!< PSIO_T::DATCTL: OUTDATWD Mask          */

#define PSIO_GNCT_DATCTL_INDATWD_Pos          (8)                                               /*!< PSIO_T::DATCTL: INDATWD Position       */
#define PSIO_GNCT_DATCTL_INDATWD_Msk          (0x1ful << PSIO_GNCT_DATCTL_INDATWD_Pos)               /*!< PSIO_T::DATCTL: INDATWD Mask           */

#define PSIO_GNCT_DATCTL_ORDER_Pos            (16)                                              /*!< PSIO_T::DATCTL: ORDER Position         */
#define PSIO_GNCT_DATCTL_ORDER_Msk            (0x1ul << PSIO_GNCT_DATCTL_ORDER_Pos)                  /*!< PSIO_T::DATCTL: ORDER Mask             */

#define PSIO_GNCT_DATCTL_OUTDEPTH_Pos         (24)                                              /*!< PSIO_T::DATCTL: OUTDEPTH Position         */
#define PSIO_GNCT_DATCTL_OUTDEPTH_Msk         (0x3ul << PSIO_GNCT_DATCTL_OUTDEPTH_Pos)          /*!< PSIO_T::DATCTL: OUTDEPTH Mask             */

#define PSIO_GNCT_DATCTL_INDEPTH_Pos          (28)                                              /*!< PSIO_T::DATCTL: INDEPTH Position         */
#define PSIO_GNCT_DATCTL_INDEPTH_Msk          (0x3ul << PSIO_GNCT_DATCTL_INDEPTH_Pos)           /*!< PSIO_T::DATCTL: INDEPTH Mask             */

#define PSIO_GNCT_INSTS_INSTS_Pos             (0)                                               /*!< PSIO_T::INSTS: INSTS Position          */
#define PSIO_GNCT_INSTS_INSTS_Msk             (0x3ffffffful << PSIO_GNCT_INSTS_INSTS_Pos)            /*!< PSIO_T::INSTS: INSTS Mask              */

