MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m256/thirdparty/m256/psio_reg.h
#define PSIO_GNCT_INSTS_INSTSOV_Pos           (30)                                              /*!< PSIO_T::INSTS: INSTSOV Position        */
#define PSIO_GNCT_INSTS_INSTSOV_Msk           (0x1ul << PSIO_GNCT_INSTS_INSTSOV_Pos)                 /*!< PSIO_T::INSTS: INSTSOV Mask            */

#define PSIO_GNCT_INSTS_VALID_Pos             (31)                                              /*!< PSIO_T::INSTS: VALID Position          */
#define PSIO_GNCT_INSTS_VALID_Msk             (0x1ul << PSIO_GNCT_INSTS_VALID_Pos)                   /*!< PSIO_T::INSTS: VALID Mask              */

#define PSIO_GNCT_INDAT_INDAT_Pos             (0)                                               /*!< PSIO_T::INDAT: INDAT Position          */
#define PSIO_GNCT_INDAT_INDAT_Msk             (0xfffffffful << PSIO_GNCT_INDAT_INDAT_Pos)            /*!< PSIO_T::INDAT: INDAT Mask              */

#define PSIO_GNCT_OUTDAT_OUTDAT_Pos           (0)                                               /*!< PSIO_T::OUTDAT: OUTDAT Position        */
#define PSIO_GNCT_OUTDAT_OUTDAT_Msk           (0xfffffffful << PSIO_GNCT_OUTDAT_OUTDAT_Pos)          /*!< PSIO_T::OUTDAT: OUTDAT Mask            */

#define PSIO_GNCT_CPCTL0_CKPT0_Pos            (0)                                               /*!< PSIO_T::CPCTL0: CKPT0 Position         */
#define PSIO_GNCT_CPCTL0_CKPT0_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT0_Pos)                  /*!< PSIO_T::CPCTL0: CKPT0 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT1_Pos            (4)                                               /*!< PSIO_T::CPCTL0: CKPT1 Position         */
#define PSIO_GNCT_CPCTL0_CKPT1_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT1_Pos)                  /*!< PSIO_T::CPCTL0: CKPT1 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT2_Pos            (8)                                               /*!< PSIO_T::CPCTL0: CKPT2 Position         */
#define PSIO_GNCT_CPCTL0_CKPT2_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT2_Pos)                  /*!< PSIO_T::CPCTL0: CKPT2 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT3_Pos            (12)                                              /*!< PSIO_T::CPCTL0: CKPT3 Position         */
#define PSIO_GNCT_CPCTL0_CKPT3_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT3_Pos)                  /*!< PSIO_T::CPCTL0: CKPT3 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT4_Pos            (16)                                              /*!< PSIO_T::CPCTL0: CKPT4 Position         */
#define PSIO_GNCT_CPCTL0_CKPT4_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT4_Pos)                  /*!< PSIO_T::CPCTL0: CKPT4 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT5_Pos            (20)                                              /*!< PSIO_T::CPCTL0: CKPT5 Position         */
#define PSIO_GNCT_CPCTL0_CKPT5_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT5_Pos)                  /*!< PSIO_T::CPCTL0: CKPT5 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT6_Pos            (24)                                              /*!< PSIO_T::CPCTL0: CKPT6 Position         */
#define PSIO_GNCT_CPCTL0_CKPT6_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT6_Pos)                  /*!< PSIO_T::CPCTL0: CKPT6 Mask             */

#define PSIO_GNCT_CPCTL0_CKPT7_Pos            (28)                                              /*!< PSIO_T::CPCTL0: CKPT7 Position         */
#define PSIO_GNCT_CPCTL0_CKPT7_Msk            (0xFul << PSIO_GNCT_CPCTL0_CKPT7_Pos)                  /*!< PSIO_T::CPCTL0: CKPT7 Mask             */

#define PSIO_GNCT_CPCTL1_CKPT0ACT_Pos         (0)                                               /*!< PSIO_T::CPCTL1: CKPT0ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT0ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT0ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT0ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT1ACT_Pos         (4)                                               /*!< PSIO_T::CPCTL1: CKPT1ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT1ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT1ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT1ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT2ACT_Pos         (8)                                               /*!< PSIO_T::CPCTL1: CKPT2ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT2ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT2ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT2ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT3ACT_Pos         (12)                                              /*!< PSIO_T::CPCTL1: CKPT3ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT3ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT3ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT3ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT4ACT_Pos         (16)                                              /*!< PSIO_T::CPCTL1: CKPT4ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT4ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT4ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT4ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT5ACT_Pos         (20)                                              /*!< PSIO_T::CPCTL1: CKPT5ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT5ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT5ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT5ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT6ACT_Pos         (24)                                              /*!< PSIO_T::CPCTL1: CKPT6ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT6ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT6ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT6ACT Mask          */

#define PSIO_GNCT_CPCTL1_CKPT7ACT_Pos         (28)                                              /*!< PSIO_T::CPCTL1: CKPT7ACT Position      */
#define PSIO_GNCT_CPCTL1_CKPT7ACT_Msk         (0x7ul << PSIO_GNCT_CPCTL1_CKPT7ACT_Pos)               /*!< PSIO_T::CPCTL1: CKPT7ACT Mask          */

/** @} PSIO_CONST */
/** @} end of PSIO register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __PSIO_REG_H__ */
